Revit 2024 API
PlanTopology Properties
The PlanTopology type exposes the following members.
Properties
Name | Description
Circuits
The Circuits of the PlanTopology.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Level
The Level of the PlanTopology.
Phase
The phase of the PlanTopology.
See Also
PlanTopology Class
Autodesk.Revit.DB Namespace